/*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
* 文件名-FileName:			 
* 附属文件-Dependencies:  	 MyProject.h; System_HeadFile.h;	
* 文件描述-File Description:	 ( 源程序-Source File)
	■ 具体项目: 总功能程序
	01) 系统状态值分配
	02) EEPROM 地址分配
	03) Flash 地址分配   
	04) 具体项目的变量定义    
	05)    06)	
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 注意事项-Attention : 	
	▲01)     ▲02)     ▲03)    ▲04)    ▲05)    ▲06)      
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 修改记录-Change History:   
	作者      时间            版本    内容描述
	Author   	   Date		      Rev          Comment
	-------------------------------------------------------------------------------
	BlueS 林  2014-08-01	      1.0	   
			   xxxx-xx-xx	      x.x	   
			   xxxx-xx-xx	      x.x				
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~	
* 公司-Company: 			CS-EMLAB  Co. , Ltd.
* 软件许可协议-Software License Agreement:
	Copyright (C) 2012-2020 	CS-EMLAB  Co. , Ltd.	All rights reserved.	

*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*/


#include "MyProject.h"	//具体项目: 总功能程序-头文件


#include "gpio_if.h"


#include "bma222.h"    //"bma222三轴加速度传感器" -驱动程序-头文件(外部资源)


////////////////////////////////////////////////////////////////////////////
//==**"此模块专用"宏定义**Module-specific macro**==============//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**项目"专用"宏定义**Project-specific macro**================//
////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////
//==**全局变量定义**Global variables**========================//
////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**系统状态机变量**=================================//
unsigned int MainState = 0;      //Main系统状态变量 
unsigned int Last_MainState = 0; //保存上一次系统状态变量 

//unsigned char G_UsersType = 0;     //用户类型:高级管理员、普通管理员



////////////////////////////////////////////////////////////////////////////
//==**工作运行时,用到的状态变量**====================//
unsigned int WorkState = 0;	      //系统工作状态变量 
unsigned int Last_WorkState = 0;  //保存上一次工作状态变量 




////////////////////////////////////////////////////////////////////////////
//==**局部变量定义**Local variables**========================//
////////////////////////////////////////////////////////////////////////////








/****************************************************************************
*函数名-Function:		void Deal_WorkState(void)
*描述- Description:	 	"处理"各工作Work▓"状态"下的事务 (状态机)
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：	▲01)    ▲02)    ▲03)    ▲04)  
*****************************************************************************/
void Deal_WorkState(void)
{

////////////////////////////////////////////////////////////////////////////
//==**工作运行: **0x8000--0x8FFF** ===========================//
////////////////////////////////////////////////////////////////////////////

	switch(WorkState) 
	{
////////////////////////////////////////////////////////////////////////////
//==**"测试时"的空闲状态** ============================//

case WORK_Test_IdleState: //Work▓"测试时"的空闲状态(工作时)

	break;

case WORK_ReadAllVaule_BMA222: //Work▓读取BMA222所有加速度数据(工作时)
	ReadAllEventVaule_BMA222(); //读取BMA222所有加速度数据(bma222三轴加速度传感器) 
	
	WorkState = WORK_Test_IdleState;  //返回到状态: 
	break;

case WORK_Alarm: //Work▓报警 (工作时)
	GPIO_IF_LedOn(MCU_RED_LED_GPIO);    //点亮LED1(红色)
		Send_Alarm_To_Cloud();  //CC3200发送报警信息给云服务器
	GPIO_IF_LedOff(MCU_RED_LED_GPIO);    //熄灭LED1(红色)

	WorkState = WORK_LowPower;  //返回到状态:  //Work▓进入休眠低功耗状态(工作时)
	break;

case WORK_LowPower: //Work▓进入休眠低功耗状态(工作时)


	WorkState = WORK_Test_IdleState;  //返回到状态: 
	
	break;
	
                          
//case : //Work▓

	//break;

 

////////////////////////////////////////////////////////////////////////////
//==**"相关测试" ( 工作菜单)** ===========================//


////////////////////////////////////////////////////////////////////////////
//==**"相关测试" ( 工作菜单)** ===========================//





////////////////////////////////////////////////////////////////////////////
default:
	break;
	}
}


